name: "pear_evaluator"
backend: "python"

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "SEGMENTATION_RESULT"
    data_type: TYPE_UINT8
    dims: [ -1, -1 ]
  }
]
output [
  {
    name: "DETECTION_RESULT"
    data_type: TYPE_FP32
    dims: [ -1, 5 ]
  }
]


instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [0]
  }
]